import React from "react";
import { Box, Grid } from "@mui/material";
import ContentCard from "../CardSectins/ContentCard";
const list = [
  {
    title: "آبشار لونک",
    info: "آبشار لونک یک آبشار دنج و جذاب در حاشیه جاده است که گردشگران حاضر در مسیر سیاهکل به دیلمان حتماً از آن بازدید می‌کنند. این مقاله به معرفی آبشار لونک و همه ویژگی‌های آن می‌پردازد.",
  },
  {
    title: "آبشار لونک",
    info: "آبشار لونک یک آبشار دنج و جذاب در حاشیه جاده است که گردشگران حاضر در مسیر سیاهکل به دیلمان حتماً از آن بازدید می‌کنند. این مقاله به معرفی آبشار لونک و همه ویژگی‌های آن می‌پردازد.",
  },
  {
    title: "آبشار لونک",
    info: "آبشار لونک یک آبشار دنج و جذاب در حاشیه جاده است که گردشگران حاضر در مسیر سیاهکل به دیلمان حتماً از آن بازدید می‌کنند. این مقاله به معرفی آبشار لونک و همه ویژگی‌های آن می‌پردازد.",
  },
  {
    title: "آبشار لونک",
    info: "آبشار لونک یک آبشار دنج و جذاب در حاشیه جاده است که گردشگران حاضر در مسیر سیاهکل به دیلمان حتماً از آن بازدید می‌کنند. این مقاله به معرفی آبشار لونک و همه ویژگی‌های آن می‌پردازد.",
  },
  {
    title: "آبشار لونک",
    info: "آبشار لونک یک آبشار دنج و جذاب در حاشیه جاده است که گردشگران حاضر در مسیر سیاهکل به دیلمان حتماً از آن بازدید می‌کنند. این مقاله به معرفی آبشار لونک و همه ویژگی‌های آن می‌پردازد.",
  },
  {
    title: "آبشار لونک",
    info: "آبشار لونک یک آبشار دنج و جذاب در حاشیه جاده است که گردشگران حاضر در مسیر سیاهکل به دیلمان حتماً از آن بازدید می‌کنند. این مقاله به معرفی آبشار لونک و همه ویژگی‌های آن می‌پردازد.",
  },
];
export default function ContentPart({ myWidth }) {
  return (
    <>
      <Grid container spacing={2} sx={{ width: myWidth }}>
        {list.map((item, i) => (
          <Grid item xs={12} sm={6} md={4} key={i}>
            <ContentCard item={item} index={i} />
          </Grid>
        ))}
      </Grid>
    </>
  );
}
